# GetSlabHeight

## Description
Gets the height of a slab.

```pascal
FUNCTION GetSlabHeight(slab : HANDLE): REAL;
```

```python
def vs.GetSlabHeight(slab):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|slab|HANDLE|The slab.|

## See Also
VS Functions:
SetSlabHeight

## Version
Availability: from Vectorworks 2011

## Category
* Objects - Architectural